tutorials/compressible/rhoPisoFoam2/pipe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:                                            |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPisoFoam;

startFrom       latestTime;

//startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-5;

writeControl    runTime;

writeInterval  1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   20;

adjustTimeStep  yes;

maxCo          0.05;

maxDeltaT       1e-4;

runTimeModifiable yes;


// ************************************************************************* //
